projects/russian-transit/src/cfe/Русский_Транзит/Catalogs/ГруппыКодовУКТЗЕД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ГруппыКодовУКТЗЕД</Name>
			<Comment>Вспомогательный справочник для оптимизации алгоритмов заполнения цен</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СоставГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьРежимыОформления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьЦеновыеГруппы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимыОфомленияСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеновыеГруппыСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляОтчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокКодов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодУКТЗЕД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторУКТВЭД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеРежимыОформления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РежимОформления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РежимыОформления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЦеновыеГруппыМашин</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеноваяГруппаМашины</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦеновыеГруппыМашин</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/Catalogs/ГруппыКодовУКТЗЕД/Forms/ФормаЭлементаУпр/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТаблРежимов = Объект.ДоступныеРежимыОформления.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РежимыОформления.Ссылка КАК Ссылка
		|ИЗ
		|	Перечисление.РежимыОформления КАК РежимыОформления
		|АВТОУПОРЯДОЧИВАНИЕ";
		
	СписокРежимовОформления.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	Для каждого ЭлСп Из СписокРежимовОформления Цикл
		ЭлСп.Пометка = (ТаблРежимов.Найти(ЭлСп.Значение, "РежимОформления") <> Неопределено);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьДоступностьРежимовОформления();	
	УстановитьДоступностьЦеновыхГрупп();	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДоступныеРежимыОформления.Очистить();
	Для каждого ЭлСп Из СписокРежимовОформления Цикл
		Если ЭлСп.Пометка Тогда
			НовСтр = ТекущийОбъект.ДоступныеРежимыОформления.Добавить();
			НовСтр.РежимОформления = ЭлСп.Значение;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура УчитыватьРежимыОформленияПриИзменении(Элемент)

	УстановитьДоступностьРежимовОформления();	
	
КонецПроцедуры

&НаКлиенте
Процедура УчитыватьЦеновыеГруппыПриИзменении(Элемент)

	УстановитьДоступностьЦеновыхГрупп();	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокРежимовОформленияПометкаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьВсеРежимы(Команда)
	
	СписокРежимовОформления.ЗаполнитьПометки(Истина);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсеРежимы(Команда)
	
	СписокРежимовОформления.ЗаполнитьПометки(Ложь);
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьДоступностьРежимовОформления()
	
	Элементы.ГруппаКоманднаяПанельСписокРежимов.Доступность = Объект.УчитыватьРежимыОформления;
	Элементы.СписокРежимовОформления.Доступность 			= Объект.УчитыватьРежимыОформления;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЦеновыхГрупп()
	
	Элементы.ЦеновыеГруппыМашин.Доступность = Объект.УчитыватьЦеновыеГруппы;
	
КонецПроцедуры

#КонецОбласти
